{"id":518,"date":"2021-09-03T05:38:44","date_gmt":"2021-09-03T05:38:44","guid":{"rendered":"http:\/\/n.m.c:81\/?p=518"},"modified":"2021-09-03T05:51:19","modified_gmt":"2021-09-03T05:51:19","slug":"nos-conseils-sur-la-qualite-de-votre-siteweb","status":"publish","type":"post","link":"http:\/\/n.m.c:81\/development\/qualite\/nos-conseils-sur-la-qualite-de-votre-siteweb\/","title":{"rendered":"Nos conseils sur la qualit\u00e9 de votre siteweb"},"content":{"rendered":"\n<h2>Code source HTML : restez l\u00e9ger !<\/h2>\n\n\n\n<p>Pour afficher une page Web, le code source HTML est la premi\u00e8re chose que les navigateurs Web t\u00e9l\u00e9chargent, analysent et mod\u00e9lisent. Si la quantit\u00e9 de code contenue dans la page est trop importante, ces \u00e9tapes sont ralenties et le rendu est retard\u00e9.<\/p>\n\n\n\n<p>Avec notre prochaine mise \u00e0 jour, nous commencerons \u00e0 v\u00e9rifier les tailles de votre page HTML. &#8220;Sizes&#8221; est au pluriel, car nous v\u00e9rifierons \u00e0 la fois la taille compress\u00e9e (par exemple: gzip) et la taille non compress\u00e9e.<br>Avoir une taille compress\u00e9e sup\u00e9rieure \u00e0 200 Ko sera consid\u00e9r\u00e9 comme un probl\u00e8me majeur. Idem pour une taille non compress\u00e9e sup\u00e9rieure \u00e0 1 Mo.<\/p>\n\n\n\n<h2>Versions jQuery non prises en charge<\/h2>\n\n\n\n<p>jQuery 1.X n&#8217;est plus pris en charge. Pour les sites utilisant l&#8217;une de ces versions, nous recommandons \u2013 au moins \u2013 de passer \u00e0 la derni\u00e8re disponible sur la branche 1.X : jQuery 1.12.<br>M\u00eame s&#8217;il n&#8217;est pas pris en charge non plus, il corrige de nombreux bugs et probl\u00e8mes de s\u00e9curit\u00e9. N\u00e9anmoins, la solution id\u00e9ale serait de passer \u00e0 la derni\u00e8re version majeure (ou d&#8217;utiliser un autre framework \u00e0 jour).<\/p>\n\n\n\n<h2>S\u00e9curisation des liens relatifs avec l&#8217;\u00e9l\u00e9ment de base et la directive CSP base-uri<\/h2>\n\n\n\n<p>Nous avons beaucoup \u00e9crit sur la politique de s\u00e9curit\u00e9 du contenu sur ce blog afin de prot\u00e9ger vos visiteurs des effets d&#8217;une attaque XSS.<br>Des pages contenant des liens relatifs pourraient \u00eatre d\u00e9tourn\u00e9es lors d&#8217;une telle attaque. Nous conseille d&#8217;utiliser l&#8217;\u00e9l\u00e9ment pour les pages utilisant des liens relatifs. Ce n&#8217;est qu&#8217;une premi\u00e8re \u00e9tape, et un attaquant pourrait toujours modifier la valeur de base s&#8217;il y a une violation XSS (ou ajouter une autre balise ).<br>Pour \u00e9viter cela, vous pouvez appliquer la valeur de l&#8217;attribut href en utilisant la directive CSP base-uri.<\/p>\n\n\n\n<h2>Gardez vos pages conviviales pour les applications de synth\u00e8se vocale<\/h2>\n\n\n\n<p>Avoir une page accessible \u00e0 tous est une question de bon sens. C&#8217;est aussi une obligation l\u00e9gale dans de plus en plus de pays.<\/p>\n\n\n\n<p>La plupart des logiciels de synth\u00e8se vocale ont des probl\u00e8mes lorsqu&#8217;ils essaient de vocaliser des \u00e9l\u00e9ments HTML vides. Nous ajouterons de nouveaux contr\u00f4les de qualit\u00e9 pour d\u00e9tecter les balises HTML probl\u00e9matiques.<\/p>\n\n\n\n<h2>Fichiers GIF, \u00e0 utiliser \u00e0 bon escient<\/h2>\n\n\n\n<p>Vous avez peut-\u00eatre d\u00e9j\u00e0 vu notre recommandation d&#8217;utiliser les formats PNG ou JPEG pour les images GIF non anim\u00e9es. Nous allons ajouter un nouveau ch\u00e8que, cette fois sur GIF anim\u00e9.<br>La prise en charge du MP4 est d\u00e9sormais quasi universelle, Nous recommandera donc d&#8217;utiliser le format vid\u00e9o plut\u00f4t que GIF, pour les tailles de fichiers sup\u00e9rieures \u00e0 100 Ko.<\/p>\n\n\n\n<h2>Des dizaines d&#8217;am\u00e9liorations pour les contr\u00f4les de qualit\u00e9 existants<\/h2>\n\n\n\n<p>Nous avons am\u00e9lior\u00e9 et ajout\u00e9 quelques d\u00e9tails sur certaines bonnes pratiques (merci \u00e0 tous les utilisateurs qui nous ont envoy\u00e9 des commentaires&nbsp;!). Nous ajusterons \u00e9galement la p\u00e9nalit\u00e9 appliqu\u00e9e pour certains contr\u00f4les de qualit\u00e9, afin de rendre les priorit\u00e9s de notre rapport toujours plus pertinentes.<\/p>\n\n\n\n<p>Le p\u00e9rim\u00e8tre de plusieurs bonnes pratiques sera \u00e9galement \u00e9largi : redirections c\u00f4t\u00e9 client, lazy-load d&#8217;images, utilisation de la meta viewport, utilisation du flash, etc.<\/p>\n\n\n\n<p>Nous d\u00e9tecterons le SPOF pour la liste suivante de fournisseurs de contenu tiers&nbsp;:<\/p>\n\n\n\n<p>Nous avons \u00e9galement corrig\u00e9 la v\u00e9rification X-Content-Type-Options pour ignorer les images, car les sp\u00e9cifications de l&#8217;en-t\u00eate ont \u00e9volu\u00e9. Merci \u00e0 @nhoizey et @etportis pour l&#8217;avoir signal\u00e9.<\/p>\n\n\n\n<p>Nous \u00e9tendrons notre recommandation d&#8217;utiliser un syst\u00e8me de mise en cache lorsque nous d\u00e9tectons un temps de r\u00e9ponse du serveur tr\u00e8s lent (sup\u00e9rieur \u00e0 3 secondes). Ce test \u00e9tait auparavant appliqu\u00e9 uniquement pour les CMS WordPress et Prestashop.<\/p>\n\n\n\n<p>Enfin, toutes les v\u00e9rifications des meilleures pratiques d&#8217;accessibilit\u00e9 seront bas\u00e9es sur le DOM plut\u00f4t que sur le code source HTML, car la plupart des logiciels et appareils prennent d\u00e9sormais en charge Javascript.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Code source HTML : restez l\u00e9ger ! Pour afficher une page Web, le code source HTML est la premi\u00e8re chose&#8230;<\/p>\n","protected":false},"author":1,"featured_media":522,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[20],"tags":[],"_links":{"self":[{"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/posts\/518"}],"collection":[{"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/comments?post=518"}],"version-history":[{"count":3,"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/posts\/518\/revisions"}],"predecessor-version":[{"id":524,"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/posts\/518\/revisions\/524"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/media\/522"}],"wp:attachment":[{"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/media?parent=518"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/categories?post=518"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/tags?post=518"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}