{"id":1,"date":"2021-05-15T18:06:23","date_gmt":"2021-05-15T18:06:23","guid":{"rendered":"http:\/\/n.m.c:81\/?p=1"},"modified":"2021-05-29T19:03:08","modified_gmt":"2021-05-29T19:03:08","slug":"apache-kafka-measure","status":"publish","type":"post","link":"http:\/\/n.m.c:81\/architecture\/apache-kafka-measure\/","title":{"rendered":"La supervision de Kafka : les mesures importantes"},"content":{"rendered":"\n<p>Kafka est une plateforme de diffusion en continu qui agit comme une file d&#8217;attente de messagerie avec publication et abonnement en recevant des donn\u00e9es de divers syst\u00e8mes sources et en les rendant disponibles \u00e0 divers syst\u00e8mes et applications en temps r\u00e9el. Les principaux avantages de l&#8217;utilisation de Kafka sont qu&#8217;il offre un stockage p\u00e9renne, ce qui signifie que les donn\u00e9es qui y sont stock\u00e9es ne peuvent pas \u00eatre facilement alt\u00e9r\u00e9es, et qu&#8217;il est tr\u00e8s \u00e9volutif, de sorte qu&#8217;il peut g\u00e9rer une forte augmentation des utilisateurs, de la charge de travail et des transactions lorsque cela est n\u00e9cessaire.<\/p>\n\n\n\n<p>Comme Kafka peut traiter de gros volumes de donn\u00e9es, de nombreuses organisations qui s&#8217;occupent de donn\u00e9es et d&#8217;\u00e9v\u00e9nements importants, telles que Netflix et Microsoft, utilisent Kafka. Pour garantir des performances optimales du serveur middleware Kafka et un fonctionnement sans faille des diverses applications critiques qui en d\u00e9pendent, il est essentiel d&#8217;utiliser une solution de surveillance.<\/p>\n\n\n\n<p>ManageEngine Applications Manager assure une surveillance proactive de Kafka et vous aide \u00e0 identifier et \u00e0 r\u00e9soudre rapidement les probl\u00e8mes, avant qu&#8217;ils n&#8217;aient un impact sur vos applications. Kafka rapporte des mesures cruciales qui sont directement li\u00e9es aux performances de votre serveur Kafka. Laissez-nous vous pr\u00e9senter les principales mesures de performance Kafka que vous devez surveiller pour g\u00e9rer efficacement vos serveurs Kafka.<\/p>\n\n\n\n<h3><strong>Utilisation de la m\u00e9moire<\/strong><\/h3>\n\n\n\n<p>Kafka, contrairement aux autres technologies de middleware, fonctionne enti\u00e8rement sur la m\u00e9moire vive. Comme le bloc d&#8217;outils d&#8217;analyse des utilisateurs n\u00e9cessite une grande quantit\u00e9 de m\u00e9moire dans la RAM, la m\u00e9moire du bloc est allou\u00e9e de mani\u00e8re dynamique en fonction du nombre de requ\u00eates entrantes sur le serveur. Dans un cas Kafka, il est crucial de toujours s&#8217;assurer que la taille du bloc de la machine virtuelle Java (JVM) n&#8217;est pas sup\u00e9rieure \u00e0 la m\u00e9moire vive disponible afin d&#8217;\u00e9viter les \u00e9changes.<\/p>\n\n\n\n<p>L&#8217;outil de surveillance Kafka du gestionnaire d&#8217;applications vous permet de surveiller les param\u00e8tres de la m\u00e9moire tels que la m\u00e9moire physique, l&#8217;utilisation de la m\u00e9moire virtuelle et l&#8217;utilisation de l&#8217;espace d&#8217;\u00e9change. Le suivi de l&#8217;utilisation de l&#8217;espace de pagination permet d&#8217;\u00e9viter les temps d&#8217;attente et de pr\u00e9venir les interruptions d&#8217;exploitation.<img src=\"https:\/\/www.pgsoftware.fr\/images\/blog\/manageengine\/Applications_Manager_Kafka-Memory-Usage-768x546.png\" alt=\"Applications Manager Kafka Memory Usage 768x546\"><\/p>\n\n\n\n<p>La MJC de Kafka comporte deux segments : la heap-memory et la non-heap memory. Alors que laheap-memory stocke les objets de donn\u00e9es r\u00e9els, la non heap-memory garde la trace des m\u00e9tadonn\u00e9es et des objets charg\u00e9s. Le moniteur Kafka du gestionnaire d&#8217;applications garde une trace de l&#8217;utilisation de votre pile pour vous aider \u00e0 d\u00e9tecter facilement les fuites de m\u00e9moire.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/www.pgsoftware.fr\/images\/blog\/manageengine\/Applications_Manager_Kafka-Heap-Details.png\" alt=\"Applications Manager Kafka Heap Details\"\/><\/figure>\n\n\n\n<h3><strong>D\u00e9tails des threads<\/strong><\/h3>\n\n\n\n<p>Toutes les demandes dans un serveur sont trait\u00e9es par des processus qui sont d\u00e9compos\u00e9s en plusieurs threads qui s&#8217;ex\u00e9cutent simultan\u00e9ment pour aider \u00e0 traiter les demandes entrantes plus rapidement. Cela permet de r\u00e9duire le temps de r\u00e9ponse et d&#8217;am\u00e9liorer la r\u00e9activit\u00e9 du serveur.<\/p>\n\n\n\n<p>Les fonctionnalit\u00e9s de surveillance du serveur Kafka du gestionnaire d&#8217;applications vous permettent de suivre les threads de la JVM dans votre instance Kafka et de fournir des d\u00e9tails sur les diff\u00e9rents threads:<\/p>\n\n\n\n<ul><li><strong>Daemon Threads:<\/strong>&nbsp;Ce sont des threads qui n&#8217;emp\u00eachent pas la JVM de sortir lorsque le programme se termine alors qu&#8217;ils fonctionnent encore en arri\u00e8re-plan.<\/li><li><strong>Live Threads:<\/strong>&nbsp;Voici les threads qui sont actuellement actifs.<\/li><li><strong>Peak Threads:<\/strong>&nbsp;C&#8217;est le nombre maximum de threads ex\u00e9cut\u00e9s dans la JVM.<\/li><\/ul>\n\n\n\n<p>La surveillance des fils de discussion dans la JVM peut s&#8217;av\u00e9rer utile \u00e0 bien des \u00e9gards. En cas de pic soudain dans l&#8217;utilisation du CPU, vous pouvez analyser les d\u00e9tails des threads pour identifier le thread qui en est la cause. La surveillance du nombre de fils de discussion actifs vous aide principalement \u00e0 d\u00e9terminer si l&#8217;utilisation actuelle d&#8217;un pool est proche de son maximum. Vous pouvez identifier les fils de discussion inactifs et les supprimer, ce qui permet d&#8217;\u00e9viter que les demandes soient rejet\u00e9es.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/www.pgsoftware.fr\/images\/blog\/manageengine\/Applications_Manager_Kafka-Thread-Details-768x549.png\" alt=\"Applications Manager Kafka Thread Details 768x549\"\/><\/figure>\n\n\n\n<h3><strong>Taux de nettoyage du journal de bord<\/strong><\/h3>\n\n\n\n<p>Les enregistrements de Kafka sont publi\u00e9s dans un flux d&#8217;enregistrements appel\u00e9s topics. Chaque topic a un journal partitionn\u00e9 d\u00e9sign\u00e9 qui demande des d\u00e9tails en annexe chaque fois que des donn\u00e9es doivent \u00eatre stock\u00e9es. Chaque partition est un journal de commit structur\u00e9 qui comporte une s\u00e9quence d&#8217;enregistrements \u00e9tiquet\u00e9s et dot\u00e9s d&#8217;un identifiant s\u00e9quentiel \u00e0 des fins d&#8217;identification.<\/p>\n\n\n\n<p>Ces enregistrements sont \u00e9crits sur le disque apr\u00e8s une p\u00e9riode d\u00e9termin\u00e9e, apr\u00e8s quoi ils sont effac\u00e9s des partitions. Le taux de vidange, c&#8217;est-\u00e0-dire le temps qu&#8217;il faut pour vider le journal sur le disque, est une mesure importante \u00e0 surveiller et constitue un indicateur direct des performances de votre instance Kafka.<\/p>\n\n\n\n<p>Le gestionnaire des applications surveille le taux de vidange du journal et vous informe si la valeur franchit un seuil d\u00e9termin\u00e9. Une valeur \u00e9lev\u00e9e du taux de vidange du journal peut entra\u00eener le maintien des demandes dans la file d&#8217;attente, ce qui se traduit par une latence et une d\u00e9gradation des performances de votre serveur middleware Kafka. Cela indique que vous devrez peut-\u00eatre v\u00e9rifier si votre mat\u00e9riel ne pr\u00e9sente pas de goulots d&#8217;\u00e9tranglement ou adapter votre serveur en cons\u00e9quence.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/www.pgsoftware.fr\/images\/blog\/manageengine\/Applications_Manager_Kafka-Log-Details-768x492.png\" alt=\"Applications Manager Kafka Log Details 768x492\"\/><\/figure>\n\n\n\n<h3><strong>Broker topic metrics<\/strong><\/h3>\n\n\n\n<p>Un serveur efficace traite toujours les demandes rapidement, sans aucune latence. La surveillance des param\u00e8tres des broker peut donner une visibilit\u00e9 sur les performances globales de votre serveur Kafka.<\/p>\n\n\n\n<p>Le gestionnaire des applications surveille diverses mesures de supervision Kafka, y compris les mesures des broker topics, pour vous aider \u00e0 comprendre le d\u00e9bit et les fluctuations des messages. La surveillance des octets in\/min aide \u00e0 identifier les gros messages, tandis que les messages in\/min servent d&#8217;indicateur de la charge sur le serveur. La surveillance des \u00e9checs des requ\u00eates de r\u00e9cup\u00e9ration (Fetch Requests\/Min) et des \u00e9checs des requ\u00eates de production (Produce Requests\/Min) peut aider \u00e0 d\u00e9tecter la d\u00e9gradation des performances de votre serveur.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/www.pgsoftware.fr\/images\/blog\/manageengine\/Applications_Manager_Kafka-Broker-Topic-Metrics-768x546.png\" alt=\"Applications Manager Kafka Broker Topic Metrics 768x546\"\/><\/figure>\n\n\n\n<h3><strong>R\u00e9plication<\/strong><\/h3>\n\n\n\n<p>La r\u00e9plication dans Kafka implique la cr\u00e9ation de copies des donn\u00e9es afin de garantir leur disponibilit\u00e9 en cas d&#8217;indisponibilit\u00e9 d&#8217;un broker. Cela peut entra\u00eener une d\u00e9gradation des performances car le broker ne sera pas en mesure de traiter les demandes si celui-ci n&#8217;est pas disponible, ce qui augmente le nombre de Partitions r\u00e9pliqu\u00e9es.<\/p>\n\n\n\n<p>Un des grands d\u00e9fis de la r\u00e9plication \u00e0 Kafka consiste \u00e0 maintenir le nombre de r\u00e9plications synchronis\u00e9es en accord avec le nombre total de r\u00e9plications. Les r\u00e9pliques qui ne sont pas synchronis\u00e9es sont les partitions qui se trouvent derri\u00e8re le leader, et sont retir\u00e9es du pool de r\u00e9pliques synchronis\u00e9es (ISR), augmentant ainsi la valeur des IsrShrinks\/Min.<\/p>\n\n\n\n<p>Le gestionnaire d&#8217;applications garde un \u0153il sur les mesures de surveillance critiques d&#8217;Apache Kafka telles que IsrShrinks\/Min et IsrExapsnds\/Min, Under Replicated Partitions, et vous informe \u00e9galement des d\u00e9passements de seuil afin de garantir des performances optimales de votre serveur middleware Kafka.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/www.pgsoftware.fr\/images\/blog\/manageengine\/Applications_Manager_Kafka-Replication.png\" alt=\"Applications Manager Kafka Replication\"\/><\/figure>\n\n\n\n<h3><strong>D\u00e9tails du r\u00e9seau<\/strong><\/h3>\n\n\n\n<p>Kafka g\u00e8re un grand nombre d&#8217;\u00e9v\u00e9nements. Il est imp\u00e9ratif de surveiller le nombre de requ\u00eates par seconde pour avoir une visibilit\u00e9 sur le d\u00e9bit du r\u00e9seau et la charge du serveur.<\/p>\n\n\n\n<p>Le gestionnaire des demandes surveille le taux de traitement des demandes et vous informe des pics. Cela peut vous aider \u00e0 analyser la largeur de bande du broker qui a \u00e9t\u00e9 affect\u00e9e afin que vous puissiez augmenter le nombre de brokers utilis\u00e9s si n\u00e9cessaire. Il vous aide \u00e9galement \u00e0 d\u00e9tecter les temps de latence du serveur.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/www.pgsoftware.fr\/images\/blog\/manageengine\/Applications_Manager_Kafka-Network-Metrics.png\" alt=\"Applications Manager Kafka Network Metrics\"\/><\/figure>\n\n\n\n<h3><strong>Informations sur le contr\u00f4leur<\/strong><\/h3>\n\n\n\n<p>Dans un cluster Kafka, l&#8217;un des brokers agit en tant que contr\u00f4leur et est responsable du maintien de l&#8217;\u00e9tat des partitions et des r\u00e9pliques. Lorsqu&#8217;une partition principale expire, l&#8217;\u00e9lection d&#8217;une nouvelle autorit\u00e9 est d\u00e9clench\u00e9e. Toute r\u00e9plique synchronis\u00e9e disponible pour la partition est \u00e9ligible pour devenir la nouvelle autorit\u00e9. L&#8217;\u00e9lection du r\u00e9f\u00e9rent entra\u00eene un l\u00e9ger retard dans la r\u00e9ponse aux demandes de partition. Gardez un \u0153il sur la mesure du taux d&#8217;\u00e9lection des autorit\u00e9s.<\/p>\n\n\n\n<p>Les \u00e9lections de mauvais r\u00e9f\u00e9rents sont caus\u00e9es par l&#8217;incapacit\u00e9 de trouver une autorit\u00e9 qualifi\u00e9e pour la partition parmi les brokers de Kafka. Lorsqu&#8217;un broker qui est le r\u00e9f\u00e9rent pour une partition se met hors ligne, un nouveau r\u00e9f\u00e9rent est \u00e9lu parmi l&#8217;ensemble des ISR pour la partition. L&#8217;\u00e9lection d&#8217;un r\u00e9f\u00e9rent non conforme est un cas particulier dans lequel aucune r\u00e9plique disponible n&#8217;est synchronis\u00e9e. Le gestionnaire d&#8217;applications vous permet de suivre le nombre d&#8217;\u00e9lections de r\u00e9f\u00e9rents non conformes par seconde et de comprendre s&#8217;il y a eu une perte de donn\u00e9es.&nbsp;<\/p>\n\n\n\n<p>Le d\u00e9compte des partitions hors ligne vous aide \u00e0 suivre le nombre de partitions qui ne sont pas inscriptibles ou lisibles car elles n&#8217;ont pas de r\u00e9f\u00e9rent actif. Vous pouvez configurer les param\u00e8tres de mani\u00e8re \u00e0 \u00eatre alert\u00e9 si cette valeur d\u00e9passe 0, car une partition sans r\u00e9f\u00e9rent actif sera absolument injoignable. Cela signifie que les utilisateurs et les propri\u00e9taires de cette partition seront bloqu\u00e9s, ce qui entra\u00eenera des retards inutiles dans le traitement des demandes sur le serveur, jusqu&#8217;\u00e0 ce qu&#8217;un r\u00e9f\u00e9rent soit disponible.<\/p>\n\n\n\n<h3><strong>Surveiller les mesures du ZooKeeper en m\u00eame temps que Kafka<\/strong><\/h3>\n\n\n\n<p>ZooKeeper stocke des m\u00e9tadonn\u00e9es sur les brokers de Kafka, les rubriques, les partitions et la coordination du syst\u00e8me. Une panne ou une lenteur de ZooKeeper peut affecter les clusters de Kafka. Vous devez \u00e9galement surveiller&nbsp;<a href=\"https:\/\/www.manageengine.com\/products\/applications_manager\/zookeeper-monitoring.html?kafka-blog\">les param\u00e8tres de ZooKeeper<\/a>&nbsp;pour maintenir un cluster Kafka sain.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Kafka est une plateforme de diffusion en continu qui agit comme une file d&#8217;attente de messagerie avec publication et abonnement&#8230;<\/p>\n","protected":false},"author":1,"featured_media":512,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"_links":{"self":[{"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/posts\/1"}],"collection":[{"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/comments?post=1"}],"version-history":[{"count":1,"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/posts\/1\/revisions"}],"predecessor-version":[{"id":499,"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/posts\/1\/revisions\/499"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/media\/512"}],"wp:attachment":[{"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/media?parent=1"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/categories?post=1"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/n.m.c:81\/wp-json\/wp\/v2\/tags?post=1"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}